{
  "doi": "2404.01980v6",
  "content": [
    {
      "type": "text",
      "text": "Abstract. In this note, we provide a very simple proof of the uniformization theorem of Riemann surfaces by Ricci flow. The argument builds on a refinement of Hamilton’s isoperimetric estimate for the Ricci flow on the two-sphere.\n\nMSC. primary, 53E20; secondary, 30F10\n\nKeywords. Ricci flow, Isoperimetric inequality, Riemann surfaces, Uniformization\n\nThe classical uniformization theorem states that every simply connected Riemann surface is conformally equivalent to one of three Riemann surfaces: the open unit disk, the complex plane, or the Riemann sphere. To prove this theorem by Ricci flow, one needs to show that: on any compact surface with a Riemannian metric, the (normalized) Ricci flow converges smoothly to a metric with constant curvature. The main difficulty lies in the genus zero (sphere) case. There have been two ways to settle this.\n\nThe first way was established by Richard Hamilton [2], improved by Bennett Chow [3, 4] and completed by Chen-Lu-Tian [6]. Hamilton first showed that the normalized Ricci flow with positive Gaussian curvature converges to a gradient shrinking Ricci soliton on the two-sphere, then Ben Chow removed the assumption of positive curvature; later Chen-Lu-Tian confirmed that any gradient shrinking Ricci soliton on the two-sphere must have constant curvature.\n\nThe second way, also opened up by Hamilton [5] and simplified by Andrews-Bryan [7], makes use of the isoperimetric data. Hamilton derived the evolution equation for the isoperimetric ratio and obtained its monotonicity to rule out the possibility of a ‘Type II’ singularity; combined with his earlier work in classifying both Type I and Type II singularities, he got a proof of the desired convergence. Andrews-Bryan’s proof is more straightforward, utilizing a comparison theorem for the isoperimetric profiles of solutions of the normalized Ricci flow with the ones of positively curved axisymmetric metric. They got rid of the blowup or compactness arguments, Harnack estimates, or any classification of behavior near singularities employed earlier by Hamilton and others; however, they invoked the Rosenau solution as the model metric to guarantee the exponential convergence of the Gaussian curvature, which seems a little bit unnatural to us.\n\nHere we provide a new simple and direct proof of Hamilton and Andrews-Bryan’s result; the only ingredients are Hamilton’s evolution equation for isoperimetric ratio, the isoperimetric inequality on curved surfaces [1], and the maximum principle. We will derive the time-dependent lower bound for the isoperimetric ratio from the maximum principle; then through the isoperimetric inequality on curved surfaces, this lower bound renders the Gaussian curvature to converge exponentially fast to constant, which is enough for the convergence of the Ricci flow.\n\nAcknowledgement. The author is partially funded by National Financial Support Program for Postdocs of China, under grant GZC20230533."
    },
    {
      "type": "text",
      "text": "For a compact surface with Riemannian metric \\((M,g)\\), we denote by \\(K(x)\\) its Gaussian curvature at point \\(x\\) and by \\(\\kappa\\) the maximum of \\(K(x)\\) on \\(M\\). The normalized Ricci flow is the equation\n\n\\[\n(2.1)\\qquad \\frac{\\partial g}{\\partial t} = 2(1-K)g\n\\]\n\nif we normalize the initial total area to be \\(4\\pi\\). It is well-known that the total area \\(\\int_M dV_g\\) remains being \\(4\\pi\\) along (2.1).\n\nConsider a curve \\(\\Lambda\\) with length \\(L\\) on \\(S^2\\) dividing the total area into two parts \\(A\\) and \\(4\\pi - A\\). We denote such curve on the \\emph{round} sphere (with the areas enclosed by it also equal \\(A\\) and \\(4\\pi-A\\)) by \\(\\bar{\\Lambda}\\) and its length by \\(\\bar{L}\\). Following Hamilton [5], the isoperimetric ratio is defined as\n\n\\[\n(2.2)\\qquad I_A := \\frac{\\inf_\\Lambda L}{\\inf_{\\bar{\\Lambda}} \\bar{L}}\n\\]\n\nNow we need the following isoperimetric inequality due to Chavel-Feldman [1]:\n\n**Theorem 2.1.** We have\n\\[\n(2.3)\\qquad L^2 \\geq 4\\pi A - \\kappa A^2\n\\]\nwith the equality achieved iff the area enclosed by \\(\\Lambda\\) is a geodesic disk with constant Gaussian curvature \\(\\kappa\\).\n\nIt is obvious that the equality can be achieved for \\(\\forall A \\in (0,4\\pi)\\) on the round sphere; for arbitrary metrics, the equality might not be achieved but the inequality is tight for \\(A \\to 0\\) (to see this, take the geodesic disk centered at the point \\(x\\) where \\(K(x)\\) attains maximum \\(\\kappa\\); let the radius approach \\(0\\), then (2.3) approaches equality on this disk). Hence from Theorem 2.1 we can easily see that\n\n\\[\n(2.4)\\qquad I_A^2 \\geq \\frac{4\\pi A - \\kappa A^2}{4\\pi A - A^2}\n\\]\n\nwith the equality being approached for \\(A \\to 0\\). Due to the Gauss-Bonnet formula \\(\\int_M K(x) dV_g = 4\\pi\\), we have \\(\\kappa > 1\\) for any non-standard metric on \\(S^2\\). Thus the tight lower bound \\(\\frac{4\\pi A - \\kappa A^2}{4\\pi A - A^2}\\) is less than 1 for non-standard metrics.\n\n**Remark 2.2.** The first order expansion \\(L = \\sqrt{4\\pi A - \\kappa A^2} = \\sqrt{4\\pi A - \\frac{\\kappa A^3}{4\\sqrt{\\pi}}} + o(A^2)\\) as \\(A \\to 0\\) of (2.3) was adopted by Andrews-Bryan [7, Theorem 2] to estimate the isoperimetric profiles; yet we only need the original version in our argument.\n\nLast but not least, we recall the evolution equation for \\(I_A\\) derived by Hamilton [5, Formula 2.1]:\n\n**Theorem 2.3.** \\(I_A\\) satisfies\n\\[\n(2.5)\\qquad \\frac{\\partial}{\\partial t}\\ln I_A^2 = \\frac{\\partial^2}{\\partial r^2}\\ln I_A^2 + \\frac{A^2 + (4\\pi - A)^2}{A(4\\pi - A)}[1-I_A^2]\n\\]\nhere \\(r\\) denotes the normal direction of the curve \\(\\Lambda\\).\n\nNote that Hamilton proved Theorem 2.3 under the unnormalized Ricci flow; nevertheless, we can easily verify that (2.5) also holds under the normalized Ricci flow (2.1) by simply repeating his calculations in [5, Section 2] with mild modifications."
    },
    {
      "type": "text",
      "text": "3. THE PROOF\n\n**Proposition 3.1.** There exist constants \\( B > 0 \\) and \\( C \\) which possibly depend on \\( A \\), such that\n\\[\nI_A^2 \\geq \\frac{1}{1 + e^{-Bt - C}}\n\\]\nfor all \\( t \\in [0, +\\infty) \\).\n\n**Proof.** From (2.4) we know that the lower bound for \\( I_A^2 \\) is no greater than 1, so we pick \\( C \\) such that \\( I_A^2 \\geq \\frac{1}{1 + e^{-C}} \\) at \\( t = 0 \\). We solve the ODE\n\\[\n\\frac{\\partial}{\\partial t} \\ln f = B[1 - f]\n\\]\nwith \\( B := \\frac{A^2 + (4\\pi - A)^2}{A(4\\pi - A)} \\) and the initial value \\( f(0) = \\frac{1}{1 + e^{-C}} \\). The solution is \\( f(t) = \\frac{1}{1 + e^{-Bt - C}} \\). By the maximum principle of heat-type equations, we conclude that the solution \\( I_A^2 \\) of the PDE (2.5) satisfies\n\\[\nI_A^2 \\geq \\frac{1}{1 + e^{-Bt - C}}\n\\]\nfor all \\( t \\in [0, +\\infty) \\). □\n\nWe can prove the uniformization theorem now.\n\n**Theorem 3.2.** *The normalized Ricci flow on \\( S^2 \\) converges to the metric with constant curvature.*\n\n**Proof.** We will show that \\( \\kappa \\) satisfies\n\\[\n\\kappa(t) - 1 \\leq (\\kappa(0) - 1)e^{-2t}\n\\]\nfor all \\( t \\in [0, +\\infty) \\). We argue by contradiction: suppose (3.2) does not hold, then there exists \\( T > 0 \\) such that \\( \\kappa(T) - 1 > (\\kappa(0) - 1)e^{-2T} \\).\n\nOn the other hand, we restrict the domain for \\( A \\) in \\( (0, \\min\\{\\frac{4\\pi}{\\kappa(0)}, \\frac{4\\pi}{\\kappa(T)}\\}) \\), and take \\( e^{-C} := \\frac{(\\kappa(0) - 1)A^2}{4\\pi A - \\kappa(0)A^2} \\), then at \\( t = 0 \\):\n\\[\nI_A^2 \\geq \\frac{4\\pi A - \\kappa(0)A^2}{4\\pi A - A^2} = \\frac{1}{1 + e^{-C}};\n\\]\nby Proposition 3.1, at \\( t = T \\) we have \\( I_A^2 \\geq \\frac{1}{1 + e^{-BT - C}} \\); since the inequality (2.4) is tight for \\( A \\to 0 \\), we can choose \\( A \\) sufficiently small such that\n\\[\n\\frac{4\\pi A - \\kappa(T)A^2}{4\\pi A - A^2} \\geq \\frac{1}{1 + e^{-BT - C}};\n\\]\nputting \\( e^{-C} = \\frac{(\\kappa(0) - 1)A^2}{4\\pi A - \\kappa(0)A^2} \\) back into the above inequality and rearranging the terms yield\n\\[\ne^{-BT} \\cdot \\frac{4\\pi A - \\kappa(T)A^2}{4\\pi A - \\kappa(0)A^2} \\geq \\frac{\\kappa(T) - 1}{\\kappa(0) - 1}.\n\\]\nSince \\( B = \\frac{A^2 + (4\\pi - A)^2}{A(4\\pi - A)} \\geq 2 \\) and \\( \\kappa(T) - 1 > (\\kappa(0) - 1)e^{-2T} \\), let \\( A \\to 0 \\) in (3.3) we get\n\\[\ne^{-2T} \\geq e^{-BT} \\cdot 1 \\geq \\frac{\\kappa(T) - 1}{\\kappa(0) - 1} > e^{-2T},\n\\]\na contradiction.\n\nThus (3.2) shows that \\( \\kappa - 1 \\) converges exponentially fast to 0. By the same arguments as in [7, Section 5], the normalized Ricci flow converges smoothly to the metric with constant Gaussian curvature \\( K \\equiv 1 \\), i.e. the round metric. □"
    },
    {
      "type": "text",
      "text": "Fudan University, 220 Handan Rd, Yangpu District, Shanghai 200433, China\n\nResearch Institute of Intelligent Complex Systems\n\nEmail address: jiyucheng1991@gmail.com"
    }
  ],
  "images": [],
  "pdf": "2404.01980v6_err1.pdf"
}