{
  "doi": "2405.05635v2",
  "content": [
    {
      "type": "text",
      "text": "This is a partial extension of the characterisation of completely join-irreducible torsionfree classes given by Barnard, Carroll and Zhu.\n\nABSTRACT. We show that every join-irreducible torsionfree class in the category of finitely generated modules over an artinian ring is cogenerated by a single (not necessarily finitely generated) brick.\n\nTorsion pairs have been a central topic in the representation theory of artin algebras in the last few years.\n\nIn particular, one of the main aspects which was thoroughly investigated is the complete lattice structure of the set of torsion (or equivalently torsionfree) classes in the category of finitely generated modules over an artin algebra, see [6].\n\nRecall that an object in some lattice is said to be completely join-irreducible if it cannot be written as an arbitrary join of strictly smaller elements.\n\nThe following result, holding in general in every abelian length category, gives a complete classification of completely join-irreducible torsion(free) classes in terms of bricks: i.e. objects whose endomorphism ring is a skew-field:\n\nTheorem 1.1 ([3, Theorem 1.0.5]). There is a bijection between the set of completely join-irreducible torsionfree classes in an abelian length category A and the set of bricks of A.\n\nHowever, in general we might have torsionfree classes which are join-irreducible, but not completely join-irreducible. Clearly, such classes can only occur when the lattice of torsionfree classes is infinite.\n\nIn fact, as a consequence of [11], we always have at least one such torsionfree class in the lattice of torsionfree classes of a τ-tilting infinite algebra.\n\nThe aim of this short note is to give a partial extension of Theorem 1.1, showing that every join-irreducible torsionfree class in the category of finitely generated modules over an artinian ring is determined by some brick.\n\nNotation Throughout the paper, Λ will be a finite-dimensional k-algebra over some field k, Λ-Mod (resp. Λ-mod) the category of (finite dimensional) left Λ-modules. Uniqueness of some object is always to be intended up to isomorphism. All the subcategories appearing in the work are assumed to be full and closed under isomorphism.\n\nFor a subcategory E of some abelian category we denote by filt(E) the closure of E under extensions and by cogen(E) the subcategory of objects which can be embedded in some finite coproduct of objects in E."
    },
    {
      "type": "text",
      "text": "Monobricks were introduced by Enomoto in [7] to study left Schur subcategories of some abelian length category. This class of subcategories contains in particular the sets of torsionfree classes and wide subcategories.\n\nThey play a prominent role in the proof of our main result, thus we give a quick overview of the subject.\n\n**Definition 2.1.** A collection of (isomorphism classes of) Λ-bricks {Bi}i∈I is a monobrick if for every f ∈ HomΛ(Bi, Bj) we have f = 0 or f is a monomorphism.\n\n**Remark 2.2.** We can see every monobrick as a poset with the following order relation Bi ≺ Bj if there exists a monomorphism f: Bi → Bj. This relation is clearly reflexive and transitive. Antisymmetry is a consequence of the definition of brick.\n\n**Definition 2.3.** Let (t, f) be a torsion pair in some abelian category A. An object 0 ≠ B in f is f-simple if all its proper quotients are in t.\n\n**Examples 2.4.**\n- Every semibrick is a monobrick, the corresponding poset is just a discrete set.\n- The collection of f-simple modules for a torsionfree class f in Λ-mod is a monobrick and the maximal elements of the corresponding poset are the minimal coextending modules for f [7, Remark 4.6].\n\nNotice that the poset corresponding to any monobrick in Λ-mod has at most countable height (only countably many dimensions of finite-dimensional modules) but it might have uncountable width (consider the case of some torsionfree class with uncountably many minimal coextending modules).\n\n**Theorem 2.5** ([7, Theorem 2.11]). *Let f be a torsionfree class in Λ-mod and simp(f) be the collection of f-simple modules. Then f = filt(simp(f)).*\n\nThe result above tells us that every torsionfree object admits a filtration in terms of f-simples.\n\n**Corollary 2.6.** *Let f be a torsionfree class. Assume there exist torsionfree classes v, w with f = v ∨ w. Then simp(f) ⊆ simp(v) ∪ simp(w).*\n\nProof. Any f-simple object B is contained in the join, which can be expressed as filtcogen(v ∪ w). However, f-simples are not filtered by other torsionfree modules, thus it must be that B ∈ cogen(v ∪ w) that is B ∈ v or B ∈ w. This shows the inclusion, as an f-simple contained in v is automatically v-simple (the torsion class corresponding to v contains the torsion class corresponding to f). The same for w. □\n\nThis result is enough to give a characterisation of join-irreducibility of a torsionfree class in terms of properties of the corresponding monobrick of simples.\n\n**Definition 2.7.** Let L be a lattice, l ∈ L is join-irreducible if l is not the 0 of L and whenever l = x ∨ y we have l = x or l = y.\n\n**Definition 2.8.** A nonempty poset P is directed if every finite subset of P has an upper bound."
    },
    {
      "type": "text",
      "text": "Proposition 2.9. Let f be a torsionfree class. Then f is join irreducible if and only if the monobrick of f-simple objects is directed.\n\nProof. “⇒” We prove the contrapositive: assume that the monobrick is not directed. If the monobrick is empty, then f = 0 thus it is not join irreducible. So assume it is non-empty.\n\nThen we can find f-simples B₁, B₂ such that B₁↑ := {B ∈ simp(f) | B₁ ≺ B} and B₂↑ are disjoint.\n\nConsider the two torsionfree classes v := filtcogen(B₁↑) and w := filtcogen(C) where C := simp(f) \\ B₁↑. Clearly, we have that f = v ∨ w as every f-simple is contained in v or in w.\n\nMoreover v ≠ f. In fact f contains B₂. If B₂ ∈ v i.e. if B₂ is in filtcogen(B₁↑) using f-simplicity we would have B₂ is in cogen(B₁↑) but this would contradict our hypothesis on the disjointness of B₁↑ and B₂↑.\n\nIn a similar way, w ≠ f as it does not contain B₁: C does not contain, by definition, any module B such that B₁ embeds in B, so using f-simplicity we can conclude that B₁ ∉ filtcogen(C). This shows that f is not join-irreducible.\n\n“⇐” Assume that the monobrick of simples is directed. Let v, w be torsionfree classes such that f = v ∨ w.\n\nBy the corollary above, every f-simple is either a v-simple or a w-simple. So assuming that v ⊊ f and w ⊊ f we can find an f-simple module B_v which is in v \\ w and an f-simple B_w which is in w \\ v. However, using the directness of the poset, we can find an f-simple B_vw such that B_w ≺ B_vw and B_v ≺ B_vw. Now it must be the case that this new simple is an element of v or of w and in both cases this yields a contradiction, as these classes are closed under submodules.\n\nIt follows that either f = v or f = w, proving join-irreducibility. □\n\nWe can also restate the description of completely join irreducible elements in terms of monobricks:\n\nCorollary 2.10 ([3], [6]). Let f be a torsionfree class in Λ-mod. Then f is completely join irreducible if and only if the monobrick of f-simple modules is directed and has finite height (i.e. it has a maximum).\n\nProof. Being completely join irreducible is equivalent to the existence of a (finitely-generated) brick B such that f = filtcogen(B), moreover a standard computation shows that the brick B is f-simple. Using this characterisation, it is immediate to see that the equivalence holds as the monobrick being directed and of finite height means that there exists a top element. □\n\nSo by exclusion we have:\n\nCorollary 2.11. Let f be a torsionfree class. Then f is join irreducible, but not completely join irreducible if and only if the monobrick of f-simple modules is directed and has infinite height."
    },
    {
      "type": "text",
      "text": "To obtain the connection with large bricks we need to use some tools from the theory of cosilting modules. We recall a couple of fundamental results and refer the reader to the survey [1] for the basic notions of silting/cosilting theory.\n\nThe first result associates with every torsion pair in the small module category a nice torsion pair in the large one. We use Cosilt(R) for the set of torsion pairs cogenerated by a cosilting module.\n\nTheorem 3.1. When R is a left noetherian ring, there is a bijection\n\ntors(R) ↔ Cosilt(R).\n\nIt associates to a torsion pair (t, f) in R - mod the limit closure (T, F) := (lim→ t, lim→ f), which coincides with the torsion pair (Gen t, t⊥0) generated by t. The inverse of this map sends a cosilting torsion pair (T, F) to its restriction (T ∩ R - mod, F ∩ R - mod).\n\nThe second result relates cosilting torsion pairs with t-structures in the derived category:\n\nTheorem 3.2 ([8], [9, Theorem 1.2], [10, Theorem 7.1]). Let R be a left noetherian ring, (t, f) a torsion pair in R - mod and (T, F) = (lim→ t, lim→ f) the corresponding cosilting torsion pair in R - Mod.\n\nThen (T, F) determines, via the HRS-construction, a t-structure (U, V) in the unbounded derived category.\n\nThe heart H of this t-structure is a locally coherent Grothendieck category and (F, T[−1]) is a torsion pair in it.\n\nMoreover, the category of finitely presented objects of H is precisely the intersection of H with the bounded derived category Db(R - mod).\n\nWe will make use of the following computational lemma:\n\nLemma 3.3 ([2, Lemma 2.3]). Let F, V be two modules in a (cosilting) torsionfree class F. Then a morphism f : F → V is an epimorphism in the corresponding heart H if and only if the cokernel of f is a torsion module.\n\nFinally, we recall the definition of a torsionfree, almost torsion module and a characterisation of those.\n\nDefinition 3.4. Let R be a ring, let (T, F) be a torsion pair in R - Mod. Then a non-zero module B is torsionfree, almost torsion if:\n(i) B ∈ F\n(ii) Every proper quotient of B is in T.\n(iii) For every short exact sequence\n\n0 → B → F → C → 0\n\nwith F ∈ F, we have that C ∈ F.\n\nProposition 3.5 ([2, Theorem 3.6]). A module B is torsionfree, almost torsion with respect to a torsion pair (T, F) if and only if it is a simple object in the heart H which is torsion with respect to (F, T[−1])."
    },
    {
      "type": "text",
      "text": "To obtain the desired connection we will make use of the following:\n\nLemma 3.6. Let (t, f) be a torsion pair in Λ–mod and let {Fi, (αij)} be a direct system of non-zero maps between f–simple modules. Then F = lim→{Fi, (αij)} is lim→ f–simple.\n\nProof. First, we notice that the direct limit is non-zero, as any non-zero map between f–simple objects is a monomorphism. In particular, each of the canonical maps Fi → F must be a monomorphism.\n\nNow we have to show that every proper quotient of F is contained in the torsion class lim→ t.\n\nUsing the fact that torsion classes are closed under quotients, this task can be reduced to proving that every maximal quotient of F is a torsion module.\n\nSo let S be a simple module with some non-zero map f : S → F. As S is a finite-dimensional module, any map from S to F can be factored trough the direct system {Fi, (αij)}. This yields a direct system of short exact sequences:\n\n0 → S  →^{fi}  Fi → coker(fi) → 0\n\nwhere each coker(fi) is contained in t as Fi is f–simple.\nThe direct limit of this system of sequences is\n\n0 → S  →^f  F → coker(f) → 0\n\nso that coker(f) is in lim→ t. This shows that every maximal quotient of F is torsion. □\n\nWhile lim→f–simple might be infinite-dimensional, it easy to observe that they are finitely generated as objects of the heart. So we can obtain a second useful lemma:\n\nLemma 3.7. Let F be a lim→f–simple module, then there exists a torsionfree, almost torsion module B such that F is isomorphic to a submodule of B.\n\nProof. Let F be lim→f–simple and consider any non-trivial finite-dimensional submodule M of F. This results in a short exact sequence\n\n0 → M → F → N → 0\n\nwhere N must be a torsion module, by simplicity. But then by Lemma 3.3, the inclusion M → F is an epimorphism, when considered as a map in the heart of the HRS-tilt at (lim→ t, lim→ f). So F is the epimorphic image of a finitely presented object, thus it is finitely generated.\n\nAs the heart is a locally coherent Grothendieck category, we know that every finitely generated object has a simple quotient, thus we have an epimorphism F → S. In particular, as F is an element of the torsion class lim→f, S will be a torsion simple.\n\nNow by Proposition 3.5, this means that S as a module is torsionfree, almost torsion for the pair (lim→ t, lim→ f).\n\nWe therefore have a non-zero map F → S which must be a monomorphism, by simplicity of F. □\n\nWe need a last technical lemma:\n\nLemma 3.8. Let G be a non-empty connected graph, then G contains a spanning tree (i.e. an acyclic connected subgraph containing all the vertices)."
    },
    {
      "type": "text",
      "text": "Proof. This is a well-known consequence of Zorn's lemma. We give the proof for completeness. Let $\\mathcal{T}$ be the collection of all the subtrees of $G$ which we can order by inclusion. Notice that $\\mathcal{T}$ is non-empty as every singleton gives a subtree of $G$ and $G$ itself is non-empty. It is easy to notice that every ascending chain of elements of $\\mathcal{T}$ has an upper bound, this is just the union of the elements of the chain.\n\nThen by Zorn's lemma the set $\\mathcal{T}$ contains some maximal element $T$. I claim that $T$ must be a spanning tree.\n\nIt is a tree by definition, so assume there is some vertex $v$ of $G$ such that $v \\notin T$. If $T$ were empty, then clearly $\\{v\\}$ would be a tree containing $T$ contradicting maximality. Thus we may assume that $T$ contains some element $t$. As $G$ is connected there exists a path starting at $t = v_0 \\to v_1 \\to \\cdots \\to v_n = v$, we may assume that this is the shortest path connecting an element of $T$ to $v$. In particular, $v_1$ is not in $T$ and we can enlarge $T$ to a new subtree $T'$ containing the vertex $v_1$ and the edge $v_0 \\to v_1$.\n\nThen $T \\subsetneq T'$ giving a contradiction. Thus $T$ must be a spanning tree.\n\nWe can now prove our main result:\n\nProposition 3.9. Let $f$ be a join-irreducible torsionfree class in $\\Lambda\\text{−mod}$. Then there exists a brick $B$ in $\\Lambda\\text{−Mod}$ which is torsionfree, almost torsion for $\\varinjlim f$ such that $f = \\mathbf{F}(B)\\cap \\Lambda\\text{−mod}$.\n\nProof. By Proposition 2.9 the poset of $f$−simples is directed. We show that the graph $G$ underlying the Hasse quiver of this poset is connected.\n\nLet $F_1$ and $F_2$ be two isomorphism classes of $f$−simples. Then by directedness there exists a third isoclass $F_3$ with $F_1 \\leq F_3$ and $F_2 \\leq F_3$. As all the isoclasses involved correspond to finite-dimensional modules, the poset of objects smaller than $F_3$ has finite height, therefore we have finite paths in the Hasse quiver connecting $F_1$ and $F_2$ to $F_3$.\n\nThis proves that the graph $G$ is connected.\n\nNow by Lemma 3.8 we can find a spanning tree $T$ in $G$, and consequently a directed acyclic subquiver $T'$ of the Hasse quiver containing all the vertices. Using the axiom of choice we assign to each vertex $v_i$ of $T'$ an $f$−simple module $V_i$ in the isoclass $v_i$ and successively to each edge $v_i \\to v_j $ a non-zero map $V_i \\to V_j$ (such a map exists by the definition of the order on $f$−simples).\n\nThis gives a directed system of $f$−simples consisting of monomorphisms (we don't have any compatibility condition to check on the maps as the underlying graph is a tree), therefore we can use Lemma 3.6 to obtain a $\\varinjlim f$−simple $F$ with the property that every $f$−simple is isomorphic to a submodule of $F$.\n\nBut now, Lemma 3.7 tells us that $F$ is a submodule of some torsionfree, almost torsion module $B$ of the class $\\varinjlim f$.\n\nSo we obtain that $f = \\mathbf{F}(B)\\cap \\Lambda\\text{−mod}$ by Theorem 2.5. $\\square$"
    },
    {
      "type": "text",
      "text": "[4] W. Crawley-Boevey; Locally finitely presented additive categories; Communications in Algebra,\n22(5), 1641–1674 (1994).\n[5] L. Demonet, O. Iyama, G. Jasso; τ-tilting finite algebras, bricks, and g-vectors, Int. Math. Res.\nNot. IMRN (2019) no. 3, 852–892.\n[6] L. Demonet, O. Iyama, N. Reading, I. Reiten, H. Thomas; Lattice theory of torsion classes: Beyond\nτ-tilting theory, Trans. Amer. Math. Soc. 10, 542–612, (April 2023).\n[7] H. Enomoto; Monobrick, a uniform approach to torsion-free classes and wide subcategories, Adv.\nMath., 393 (2021).\n[8] C. Parra, M. Saorín; Direct limits in the heart of a t-structure: the case of a torsion pair, Journal\nof Pure and Applied Algebra, 219(9):4117–4143 (2015).\n[9] C. Parra, M. Saorín; Addendum to Direct limits in the heart of a t-structure: the case of a torsion\npair, J. Pure Appl. Algebra 219 (9).\n[10] C. Parra, M. Saorín, S. Virili; Locally finitely presented and coherent hearts, Rev. Mat. Iberoam.\n(2019).\n[11] F. Sentieri; A brick version of a theorem of Auslander, Nagoya Math. J., 249, 88–106 (March 2023)."
    }
  ],
  "images": [],
  "pdf": "2405.05635v1.pdf"
}