{
  "doi": "2408.16162v2",
  "content": [
    {
      "type": "text",
      "text": "The notation and terminology in this note are mostly standard and follow [5, 7]. A cardinal is an initial ordinal and an ordinal is the set of smaller ordinals. In particular, 𝔠 denotes 2^{ℵ₀}. By a Polish group we mean a topological group with a Polish (that is, a separable and completely metrizable) group topology. Given a topological group G, a topological automorphism of G is a map φ: G → G that is simultaneously a group automorphism and a self-homeomorphism.\n\nOutside the class of Polish groups, there are topological groups whose only topological automorphism is the identity. A remarkable example is van Mill's construction of a Baire separable metric connected and locally connected group having no homeomorphisms other than group translations [11]. In the opposite direction, William Barit and Peter Renaud proved that every Hausdorff locally compact group with more than two elements has a non-trivial topological automorphism [3].\n\nSince Hausdorff locally compact groups are Polish if they are second-countable, the question of whether the result due to Barit and Renaud can be generalized to any Polish group naturally arises. We will prove that this is indeed the case. This answers a question posed by Forte Shinko during the Thematic Program on Set Theoretic Methods in Algebra, Dynamics and Geometry (Fields Institute, January–June, 2023).\n\nNote that by van Mill's example, we cannot drop the complete metrizability of the groups considered in Theorem 1.1; even if we assume that such groups are Baire, metrizable and separable.\n\nABSTRACT. We prove that every Polish group admits a non-trivial topological group automorphism. This answers a question posed by Forte Shinko. As a consequence, we prove that there are no uniquely homogeneous Polish groups.\n\nTheorem 1.1. Every Polish group with more than two elements admits a non-trivial topological automorphism.\n\nCARLOS PÉREZ ESTRADA AND ULISES ARIET RAMOS-GARCÍA\n\nA natural question motivated by Theorem 1.1 is how complicated the non-trivial topological automorphisms of a Polish group can be. For example, at the lowest difficulty level we have that for extended mapping class groups of (connected)"
    },
    {
      "type": "text",
      "text": "metrizablesurfacesandtheirfiniteindexsubgroups,everyalgebraicautomorphism\nisfaithfullyrepresentedbyaconjugationwithamappingclass[4].Inparticular,\neveryextendedmappingclassgroupisnaturallyisomorphic(as an abstract group)\nto its automorphism group.\n\nOur first observation is that for non-Boolean topological groups there is always\na non-trivial topological automorphism.\n\n**Proposition 2.1.** Let \\( G \\) be a topological group. If \\( G \\) is not abelian or it has an\nelement of order greater than 2, then \\( G \\) has a non-trivial topological automorphism.\n\n*Proof.* If \\( G \\) is not abelian, then there exist two non-trivial elements \\( g, h \\in G \\) for\nwhich \\( h \\neq ghg^{-1} \\). Consequently, by conjugating with \\( g \\) or \\( h \\) we get a non-trivial\ntopological automorphism that does not fix \\( h \\) or \\( g \\), respectively. On the other hand,\nif \\( G \\) is abelian but it has a non-trivial element \\( x \\) of order greater than 2, then the\ninversion of elements is a non-trivial topological automorphism of \\( G \\) because it does\nnot fix \\( x \\). □\n\nIn light of Proposition 2.1, we restrict our attention to non-trivial topological\nautomorphisms on topological Boolean groups. Given an abstract Boolean group\n\\( G \\), we endow it with its canonical structure as a vector space over the field of\ntwo elements \\( \\mathbb{Z}_2 \\). This vector space structure gives rise to a linear isomorphism\nbetween \\( G \\) and a direct sum of \\( \\kappa \\) copies of \\( \\mathbb{Z}_2 \\) for some cardinal \\( \\kappa \\). If additionally\n\\( G \\) admits a Polish group topology, either \\( G \\) is countable, and so \\( \\kappa \\leq \\omega \\), or \\( G \\) has\ncontinuum cardinality, in which case \\( \\kappa = \\mathfrak{c} \\). In the former case, \\( G \\) is discrete and\nwhen \\( \\kappa = n < \\omega \\), the automorphism group of \\( G \\) is precisely the general linear\ngroup \\( \\mathrm{GL}_n(\\mathbb{Z}_2) \\) because every group automorphism of a Boolean group is a linear\n\\( \\mathbb{Z}_2 \\)-automorphism. Such general linear group \\( \\mathrm{GL}_n(\\mathbb{Z}_2) \\) has order \\( (2^n-1)(2^n-2)\\cdots(2^n-2^{n-1}) \\). When \\( \\kappa = \\omega \\), the automorphism group \\( \\mathrm{Aut}(G) \\) carries a non-\ndiscrete Polish group topology under the pointwise-convergence topology, and thus\nits cardinality is \\( \\mathfrak{c} \\).\n\nIt remains to consider non-trivial topological automorphisms for Boolean Polish\ngroups \\( G \\) of continuum cardinality. In order to do this, we will construct a non-\ntrivial topological automorphism on a dense subgroup of \\( G \\) and then we will extend\nit to the latter using the following lemma.\n\n**Lemma 2.2.** Let \\( G \\) be a Polish group and \\( H \\) a dense subgroup of \\( G \\). Then every\ntopological automorphism of \\( H \\) extends uniquely to a topological automorphism of\n\\( G \\).\n\n*Proof.* Let \\( \\varphi \\) be a topological automorphism of \\( H \\). If we consider \\( \\varphi \\) to be a con-\ntinuous homomorphism from \\( H \\) to \\( G \\), then there exists a unique continuous ex-\ntension \\( \\overline{\\varphi} : G \\to G \\) of \\( \\varphi \\) by the density of \\( H \\) in \\( G \\) ([5, Page 6]). Extending anal-\nogously \\( \\varphi^{-1}: H \\to G \\) to a continuous homomorphism \\( \\overline{\\varphi^{-1}} : G \\to G \\), we see that\n\\( \\overline{\\varphi} \\circ \\overline{\\varphi^{-1}} = \\mathrm{Id}_G \\) and \\( \\overline{\\varphi^{-1}} \\circ \\overline{\\varphi} = \\mathrm{Id}_G \\) since the identity map of \\( G \\) as well as these\ncompositions extend the identity map of \\( H \\). It follows that the desired topological\nautomorphism of \\( G \\) extending \\( \\varphi \\) is \\( \\overline{\\varphi} \\). □\n\nThe next key lemma plays an important role in our construction."
    },
    {
      "type": "text",
      "text": "Lemma 2.3. Let (G, +, τ) be a Boolean Hausdorff topological group. For every finite collection {xi}i<n ⊆ G of Z₂-linearly independent elements, there exists an identity neighbourhood U such that\n\n(1) for every two distinct elements x, x' ∈ L := span{xi}i<n, (x + U) ∩ (x' + U) = ∅; and\n(2) FL := G \\ (L + U) has empty interior.\n\nProof. Consider the family\n\n𝒫 = {U ∈ τ : 0_G ∈ U ∧ ∀x, y ∈ L (x ≠ y ⇒ (x + U) ∩ (y + U) = ∅)}\n\nordered under inclusion. We will use the Kuratowski–Zorn lemma to show that (𝒫, ⊆) has a maximal element and then we will prove that any such maximal element fulfills items (1) and (2) above.\n\nTo verify that 𝒫 is not empty, first note that, since L is a finite set and G is a Hausdorff space, there exists a disjoint family of open sets {Ux}x∈L such that x ∈ Ux for every x ∈ L. Take any such family and notice that the identity neighbourhood U := ⋂_{x∈L} x + Ux ∈ 𝒫. Indeed, given any two different x, y ∈ L, (x + U) ∩ (y + U) ⊆ (x + x + Ux) ∩ (y + y + Uy) = Ux ∩ Uy = ∅.\n\nNow, if {Uα}α∈I ⊆ 𝒫 is a linearly ordered subset, then UI := ⋃_{α∈I} Uα is an upper bound of it since for any two different x, y ∈ L, if\n\n∅ ≠ (x + UI) ∩ (y + UI)\n = (x + ⋃ Uα) ∩ (y + ⋃ Uα)\n    α∈I      α∈I\n = (⋃ (x + Uα)) ∩ (⋃ (y + Uα)),\n  α∈I     α∈I\n\nthen certainly there would exist two α, β ∈ I for which (x + Uα) ∩ (y + Uβ) ≠ ∅, and thus by considering α ≥ β we would get that (x + Uα) ∩ (y + Uα) ≠ ∅, which would be a contradiction.\n\nLet U be a ⊆-maximal element of 𝒫. To see that FL := G \\ (L + U) has empty interior, we will proceed by contradiction. First note that if V := int(FL) ≠ ∅, then V + L ⊆ FL since if there were v ∈ V, u ∈ U and x₁, x₂ ∈ L such that v + x₁ = u + x₂, then v = (x₁ + x₂) + u ∈ (L + U) ∩ V, which is not possible. A consequence of this fact is that for any x ∈ L, x + V = V. Indeed, as V is the greatest open set contained in FL, certainly x + V ⊆ V for every x ∈ L. On the other hand, since any v ∈ V can be written as v = x + (x + v) and x + v ∈ x + V ⊆ V for every x ∈ L, we conclude that V ⊆ x + V for all x ∈ L.\n\nNow we construct a non-empty open subset V′ ⊆ V for which (x + V′) + (y + V′) = ∅ if x, y ∈ L are distinct. In order to do this, for any v ∈ V consider a disjoint family of open sets {Ux}x∈L in V such that v + x ∈ Ux for any x ∈ L. Then we can consider V′ as ⋂_{x∈L} x + Ux. Note that v ∈ V′ because for any x ∈ L, v = x + (x + v) ∈ x + Ux. Moreover, V′ ⊆ U_{0_G} ⊆ V and certainly for each two distinct x, y ∈ L, (x + V′) + (y + V′) ⊆ (x + x + Ux) ∩ (y + y + Uy) = ∅."
    },
    {
      "type": "text",
      "text": "We claim that the identity neighbourhood \\( W := U \\cup V' \\in \\mathbb{P} \\). Indeed, note that for any two different \\( x, y \\in L \\),\n\n\\[\n(x+W) \\cap (y+W) = (x + (U \\cup V')) \\cap (y + (U \\cup V')) \\\\\n= ((x+U) \\cup (x+V')) \\cap ((y+U) \\cup (y+V')) \\\\\n= ((x+U) \\cap (y+U)) \\cup ((x+U) \\cap (y+V')) \\cup \\\\\n\\qquad ((x+V') \\cap (y+U)) \\cup ((x+V') \\cap (y+V')) \\\\\n= \\varnothing.\n\\]\n\nSince \\( V' \\neq \\varnothing \\), \\( W \\) is an element of \\( \\mathbb{P} \\) that strictly contains the maximal element \\( U \\). Hence we reach a contradiction by assuming that \\( F_L \\) has non-empty interior. \\(\\Box\\)\n\nProof of Theorem 1.1. Let \\( G \\) be a Polish group with more than two elements. By the preceding remarks, the only case left to consider is when \\( G \\) is a Boolean group of continuum cardinality.\n\nLet \\( \\{x_i\\}_{i<n} \\subset G \\) be a finite collection with more than two elements of \\(\\mathbb{Z}_2\\)-linearly independent elements. Consider an identity neighbourhood \\( U \\subset G \\) as in Lemma 2.3 associated to \\( \\{x_i\\}_{i<n} \\). As \\( G \\) is necessarily non-discrete, the neighbourhood \\( U \\) is infinite. Since \\( U \\) does not contain non-trivial linear combinations of \\( \\{x_i\\}_{i<n} \\), every \\( t \\in U \\setminus \\{0_G\\} \\) is \\(\\mathbb{Z}_2\\)-linearly independent from \\( \\{x_i\\}_{i<n} \\).\n\nWith the Kuratowski–Zorn lemma we can construct a maximal \\(\\mathbb{Z}_2\\)-linearly independent subset \\( Y \\subseteq U \\). Note that \\( U \\subseteq \\text{span}(Y) \\) since if there were a \\( u \\in U \\setminus \\text{span}(Y) \\), then certainly \\( Y \\cup \\{u\\} \\) would be a linearly independent subset of \\( U \\) strictly larger than \\( Y \\), contradicting the maximality of the latter. Consequently, we can consider the subgroup \\( H \\subseteq G \\) generated by \\( Y \\) and \\( \\{x_i\\}_{i<n} \\). By item (2) of Lemma 2.3, \\( H \\) is dense in \\( G \\) since it contains the dense subset \\( U + \\text{span}\\{x_i\\}_{i<n} \\).\n\nAs a result, to construct the desired topological group automorphism we take any non-trivial automorphism \\( \\varphi \\) of \\( \\text{span}\\{x_i\\}_{i<n} \\) and extend it to a \\(\\mathbb{Z}_2\\)-automorphism of \\( H \\) by setting \\( \\varphi(y) = y \\) for \\( y \\in Y \\). Note that \\( \\varphi \\) is a homeomorphism since for any neighbourhood identity \\( V \\) of \\( 0_H \\), the identity neighbourhood \\( U \\cap V \\) is such that \\( \\varphi(U \\cap V) = U \\cap V \\subseteq V \\) and certainly the same happens with \\( \\varphi^{-1} \\). Consequently, by Lemma 2.2 we can extend \\( \\varphi \\) to a non-trivial topological automorphism of \\( G \\). \\(\\Box\\)\n\nThe main motivation of [3] was to fully answer a question posed by Edmund Burgess\\(^1\\) at the 1955 Wisconsin topology conference ([1]) about the existence of uniquely homogeneous continua, i.e., about the existence of a compact connected metrizable space \\( X \\) such that for any two points \\( p, q \\in X \\) there is a unique homeomorphism carrying \\( p \\) to \\( q \\).\n\nIn [10] Gerald Ungar used the renowned work of Edward Effros [6] on Polish transformation groups; i.e., pairs \\( (G, X) \\) where \\( G \\) is a Polish group acting continuously on the Polish space \\( X \\), to negatively answer Burgess’s question in the case of finite dimensional continua. We will roughly sketch Ungar's idea for general locally compact Polish spaces. Given a Polish transformation group \\( (G, X) \\), the space \\( X \\) is a quotient of \\( G \\) if \\( X \\) is homogeneous ([6, Theorem 2.1]). Therefore, as the homeomorphism group of a locally compact Polish space is a Polish group under\n\n\\(^1\\)Although this question is often attributed to Burgess, he mentions in the MathSciNet review of [10] that this question was raised by another member of the conference."
    },
    {
      "type": "text",
      "text": "the g-topology² and the canonical action of such group on the respective space is continuous [2, Theorems 1 and 3], any homogeneous locally compact Polish space is necessarily a quotient of its homeomorphism group. In particular, uniquely homogeneous locally compact Polish spaces are homeomorphic to their homeomorphism groups and thus carry the structure of boolean locally compact Polish groups with no non-trivial topological automorphisms ([10, Theorems 3.15 and 3.16]). Finally, Ungar used structural results of locally compact groups ([8, Theorems 4.9.3 and 4.10.1]) to remark that finite dimensional Polish groups that are either compact and connected or locally compact and locally connected have lots of non-trivial topological automorphisms.\n\nBased on the idea of Ungar, Barit and Renaud used the same structural theory of locally compact groups and (non-commutative) Pontryagin duality to construct non-trivial topological automorphisms on any locally compact group with more than two elements. This fully answered Burguess' question in the negative for general locally compact Polish spaces.\n\nWe must point out that our proof of Theorem 1.1 only uses elementary theory of completely metrizable spaces (in particular, [7, Theorem 3.11] and [5, Page 6]) and thus we consider it to be more elementary than the one given by Barit and Renaud. It also negatively solves Burguess' question for the class of Polish spaces admitting a topological group structure.\n\nTheorem 3.1. A non-trivial Polish group cannot be uniquely homogeneous.\n\nIt would be desirable to improve Theorem 3.1 to the class of all Polish spaces [11, Question 5.1]. One strategy for it would be to use Ungar's idea of giving a Polish group topology to the homeomorphism group of a uniquely homogeneous Polish space for which the canonical action were continuous and then use Theorem 3.1 to have a contradiction. However, it is known that the homeomorphism group of certain homogeneous Polish spaces, e.g., the Baire space ω^ω, cannot carry a Polish group topology ([9, Corollary 3]). A weaker statement, but still sufficient for our purposes, would be to regard a uniquely homogeneous Polish space as a quotient of a Polish group. But as before, there are homogeneous Polish spaces that cannot be a quotient of a Polish group ([12]). Bearing in mind that the previous examples are not uniquely homogeneous, there is still hope to use the unique homogeneity of a Polish space to make it the quotient of a Polish group.\n\nQuestion 3.2. Is a uniquely homogeneous Polish space necessarily the quotient of a Polish group?\n\nAs Barit and Renaud, we required the axiom of choice to prove our main result. In particular, we use its Kuratowski-Zorn version in Lemma 2.3 to construct the identity neighbourhood U and the axiom of choice itself when finding a maximal Z₂-linearly independent subset Y ⊆ U. It seems plausible that the maximal Z₂-linearly independent subset can be constructed in ZF alone by using metrics; but it is not clear for us if the use of choice is superfluous in the construction of the neighbourhood U.\n\n²The g-topology on the homeomorphism group of a topological space X has as subbasis the family of neighbourhoods of the form\n\nV(K, U) := {f ∈ Homeo(X) | f(K) ⊆ U}\n\nfor every closed K ⊆ X and open U ⊆ X such that either K or X \\ U is compact."
    },
    {
      "type": "text",
      "text": "Question 3.3. Is the Axiom of Choice really necessary to construct non-trivial topological automorphisms on every Polish group?\n\nAcknowledgments. This research was motivated while the authors were part of the Thematic Program on Set Theoretic Methods in Algebra, Dynamics and Geometry at the Fields Institute. We would like to thank the Institute for its warm hospitality. We would also like to thank Michael Hrušák for reading a preliminary version of our manuscript.\n\nPOSGRADO CONJUNTO EN CIENCIAS MATEMÁTICAS UNAM-UMSNH, Morelia, Michoacán, México 58089\n\nEmail address: cperez@matmor.unam.mx\n\nCENTRO DE CIENCIAS MATEMÁTICAS, UNIVERSIDAD NACIONAL AUTÓNOMA DE MÉXICO, CAMPUS MORELIA, Morelia, Michoacán, México 58089"
    }
  ],
  "images": [],
  "pdf": "2408.16162v2_err1.pdf"
}